#ifndef PROTOCOL_H
#define PROTOCOL_H

//== МАКРОСЫ.
#define MAX_MSG						512

// Утиль.
#define PObjNaming(name)			o##name // Создаёт имя объекта структуры добавлением 'o' в начале.
#define PObjDecl(name)				name PObjNaming(name) // Унифицированная декларация объектов.

//
// ========================= КОДЫ ВЗАИМОДЕЙСТВИЯ ==============================
#define PROTO_C_SEND_PASSW			'a'
#define PROTO_S_PASSW_OK			'b'
#define PROTO_S_PASSW_ERR			'c'
// ============================================================================

// ============================ КОДЫ ПАКЕТОВ ==================================
#define PROTO_O_TEXT_MSG			't'
// ============================================================================

//== КЛАССЫ.
/// Класс хранилища протокола.
class ProtocolStorage
{

public:
// ====================== ОБЪЯВЛЕНИЯ СТРУКТУР ПАКЕТОВ =========================
	struct TextMsg
	{
		char m_chMsg[MAX_MSG];
	};
// ============================================================================

public:
// ============================ ОБЪЕКТЫ ПАКЕТОВ ===============================
	PObjDecl(TextMsg);
// ============================================================================

};

#endif // PROTOCOL_H
